︠a609062e-567b-4ebb-a54d-54ffe3696754s︠
data = [815, 237, 19, 477, 417, 692, 219, 613, 594, 514, 543, 103, 49, 27, 983, 491, 825, 287, 138, 972]
︡1be2a0a6-5662-4345-9e4a-9372c9be1af6︡{"done":true}
︠b87f453a-b2c0-43a7-a849-a9b316080685︠
# Media móvil en bloques de cuatro:
moving_average(data , 4)
︡b9221b6c-9437-4370-a1c1-74457f16299c︡{"stdout":"[387, 575/2, 1605/4, 1805/4, 1941/4, 1059/2, 485, 566, 877/2, 1209/4, 361/2, 581/2, 775/2, 1163/2, 1293/2, 1741/4, 1111/2]\n"}︡{"done":true}
︠9f559746-e402-4953-9708-4b5e9cacd333s︠
moving_average(data , 10)
︡4447c170-0294-409a-9b74-1cf035354b78︡{"stdout":"[4597/10, 865/2, 4191/10, 4221/10, 3771/10, 4337/10, 2068/5, 2371/5, 2208/5, 396, 2209/5]\n"}︡{"done":true}
︠12695ace-cc84-4184-b107-5cfcc8cca163s︠
moving_average(data , 20)
︡77f8a286-ffde-4f87-8eb0-3ebd65b3e2fa︡{"stdout":"[1803/4]\n"}︡{"done":true}
︠04a97606-29c0-41bf-a332-2f20a31548bf︠









